In [1]:
import numpy as np
import pandas as pd

In [2]:
import pandas as pd
from numpy.random import randint
  
dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
  
df = pd.DataFrame(dict)

In [3]:
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [13]:
dic2 = {'Name': 'Amy', 'Maths': 89, 'Science': 93}

In [19]:
df2=pd.DataFrame(dic2, index=[0])

In [20]:
pd.concat([df, pd.DataFrame(df2)], ignore_index=True)

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93

In [22]:
x = pd.DataFrame(columns=['1', '2'])

In [26]:
y = pd.DataFrame( {'1': 'ALI', '2':'GHOLI'}, index=[0])

In [28]:
pd.concat([x, y], ignore_index=True)

     1      2
0  ALI  GHOLI

In [29]:
k = 4

In [33]:
str(num + str(k)) = 476

SyntaxError: cannot assign to function call (502301589.py, line 1)

In [35]:
k[0] = 3

TypeError: 'int' object does not support item assignment

In [38]:
for i in range(1,4):
    print(i)

1
2
3

In [52]:
my_name = 'kasra'

In [54]:
# Give some random dynamic variable name as static input and store it in a variable.
dynamicvariable= my_name + 'SRD'
# Assign the above dynamic variable name with some other random name using the 
# locals() function 
locals()[dynamicvariable] = pd.DataFrame( {'1': 'one', '2': 'two'}, index=[0])
# Print the value of the dynamicvariable which is initialized at the first.
print(kasraSRD)

     1    2
0  one  two

In [55]:
kasraSRD

     1    2
0  one  two

In [56]:
str('trt')

'trt'